cask_args appdir: "/Applications"

tap "codeclimate/formulae"
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
#tap "homebrew/cask-fonts"
#tap "homebrew/cask-versions"
#tap "homebrew/cask-cask"
brew "curl"
brew "git"
brew "htop"
brew "neovim"
brew "the_silver_searcher"
brew "tldr"

cask "iterm2"
cask "appcleaner"
cask "firefox"
cask "iina"
cask "wwdc"
cask "visual-studio-code"
#cask "caskroom/fonts/font-mplus-nerd-font-mono"
cask "caskroom/fonts/font-mononoki"
cask "caskroom/fonts/font-roboto"
cask "caskroom/fonts/font-source-code-pro"
#brew "mysql", restart_service: true
#brew "redis", restart_service: true
cask "google-chrome"
#brew "aria2"
#brew "docker"
