cask_args appdir: "/Applications"

tap "codeclimate/formulae"
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "caskroom/cask"
tap "caskroom/cask"
# tap "telemachus/brew", "https://telemachus@bitbucket.org/telemachus/brew.git"
# brew "imagemagick"
# brew "emacs", args: ["with-cocoa", "with-gnutls"]
brew "aria2"
brew "ctags"
brew "curl"
brew "dnsmasq"
brew "docker"
brew "git"
brew "htop"
brew "macvim", args: ["--with-lua"]
brew "mysql", restart_service: true
brew "redis", restart_service: true
brew "the_silver_searcher"
brew "wget"

cask "alfred"
cask "aliwangwang"
cask "appcleaner"
cask "firefox"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "macdown"
cask "wwdc"
cask "pomotodo"
cask "hammerspoon"
cask "caskroom/fonts/font-mononoki"
cask "caskroom/fonts/font-roboto"
cask "caskroom/fonts/font-source-code-pro"

mas "magnet", id: 441258766
mas "Noizio", id: 928871589
mas "WeChat", id: 836500024
mas "网易有道词典", id: 491854842
